#include <reg52.h>
#include "ucharuint.h"


/******************************************************************
函 数: void ms_delay(int t)/us_delay(uchar t)
功 能: 毫秒级延时
参 数: 无
返回值: 无
*******************************************************************/
void ms_delay(int t) 
{  
	int i,j; 
		for(i=t;i>0;i--)   
	for(j=110;j>0;j--); 
}
void us_delay(uchar t)
{
      while(t--);
}

void Delay(unsigned int t)
{
 while(--t);
}
///******************************************************************
//函 数: void LED(void)
//功 能: 发送完命令后显示用的函数
//参 数: 无
//返回值: 无
//*******************************************************************/
//void LED(void)
//{
//	P1 = 0;
//	ms_delay(100);
//	P1 = 0xff;
//	ms_delay(100);
//}



